Revit 2027 API
MasonryCMU.MasonryCMUApplication Property
 The property labeled "Finish" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MasonryCMUApplication { get; }
Public Shared ReadOnly Property MasonryCMUApplication As String
	Get
public:
static property String^ MasonryCMUApplication {
	String^ get ();
}
static member MasonryCMUApplication : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUApplicationType".
See Also
Reference
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace